cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>PIN%s</name>
			<displayName>PIN[%s]</displayName>
			<description>Port Pin value register using MASK.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>VAL0</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>VAL1</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>VAL2</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>VAL3</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>VAL4</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>VAL5</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>VAL6</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>VAL7</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>VAL8</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>VAL9</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>VAL10</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>VAL11</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>VAL12</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>VAL13</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>VAL14</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>VAL15</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>VAL16</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>VAL17</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>VAL18</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>VAL19</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>VAL20</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>VAL21</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>VAL22</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>VAL23</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>VAL24</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>VAL25</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>VAL26</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>VAL27</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>VAL28</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>VAL29</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>VAL30</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>VAL31</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xCLR corresponds to pin Px[0], bit 31 in xCLR corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>SET%s</name>
			
