cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
			<description>Port Output Set register using MASK.</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PSET0</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PSET1</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>PSET2</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>PSET3</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>PSET4</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PSET5</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PSET6</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PSET7</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PSET8</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>PSET9</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>PSET10</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>PSET11</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>PSET12</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>PSET13</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>PSET14</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>PSET15</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>PSET16</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>PSET17</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>PSET18</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>PSET19</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>PSET20</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>PSET21</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>PSET22</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>PSET23</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>PSET24</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>PSET25</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>PSET26</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>PSET27</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PSET28</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>PSET29</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>PSET30</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>PSET31</name>
					<description>Fast GPIO output value Set bits. Bit 0 in xSET controls pin Px[0], bit 31 in xSET controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>CLR%s</name>
			
			<description>Port Output Clear register using MASK.</description>
			<addressOffset>0x01C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PCLR0</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PCLR1</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>PCLR2</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>PCLR3</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>PCLR4</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PCLR5</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PCLR6</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PCLR7</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PCLR8</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>PCLR9</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>PCLR10</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>PCLR11</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>PCLR12</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>PCLR13</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>PCLR14</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>PCLR15</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>PCLR16</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>PCLR17</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>PCLR18</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>PCLR19</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>PCLR20</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>PCLR21</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>PCLR22</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>PCLR23</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>PCLR24</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>PCLR25</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>PCLR26</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>PCLR27</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PCLR28</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>PCLR29</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>PCLR30</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>PCLR31</name>
					<description>Fast GPIO output value Clear bits. Bit 0 in xCLR controls pin Px[0], bit 31 controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to LOW.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
