cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-3</dimIndex>
					<name>ADR%s</name>
					<description>I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GC</name>
							<description>General Call enable bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>Address</name>
							<description>The I2C device address for slave mode.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA_BUFFER</name>
					<description>Data buffer register. The contents of the 8 MSBs of the DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Data</name>
							<description>This register holds contents of the 8 MSBs of the DAT shift register.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MASK[%s]</name>
					<displayName>MASK[%s]</displayName>
					<description>I2C Slave address mask register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved bits. This bit reads always back as 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MASK</name>
							<description>Mask bits.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
	<name>COMPARATOR</name>
	<description>Comparators</description>
	<groupName>COMPARATOR</groupName>
	<baseAddress>0x40020000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>CMP0</name>
	<value>41</value>
	</interrupt>
			<interrupt>
				<name>CMP1</name>
				<value>42</value>
			</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>Comparator block control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMP_PD_IREF</name>
					<description>Controls the current source used by the comparators. These bits must be set when either comparator is used.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>The comparator current source is disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>The comparator current source is disabled in Deep Sleep and Power-down modes and restored automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>The comparator current source is disabled in Power-down mode and restored automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>The comparator current source is powered up.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_PD_VBG</name>
					<description>Controls the bandgap reference source that is used by the comparators. These bits must be set when either comparator is used.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>The comparator bandgap reference is disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>The comparator bandgap reference is disabled in Deep Sleep and Power-down modes and restored automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>The comparator bandgap reference is disabled in Power-down mode and restored automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>The comparator bandgap reference is powered up.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_VTEMP</name>
					<description>Controls the voltage reference of the temperature sensor. These bits must be set when the temperature sensor is used.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>The temperature sensor voltage reference is disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>The temperature sensor voltage reference is disabled in Deep Sleep and Power-down modes and restored automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>The temperature sensor voltage reference is disabled in Power-down mode and restored automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>The temperature sensor voltage reference is powered up.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_TEMPSEN</name>
					<description>Enables the temperature sensor. These bits must be set when the temperature sensor is used.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Temperature sensor is disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>The temperature sensor is disabled in Deep Sleep and Power-down modes and restored automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>The temperature sensor is disabled in Power-down mode and restored automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Temperature sensor is enabled.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_ROSCCTL</name>
					<description>Selects the inputs for the flip/flops that provide the CMP_ROSC output.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CMP1</name>
							<description>The CMP_ROSC output is set by CMP1 and reset by CMP0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0</name>
							<description>The CMP_ROSC output is set by CMP0 and reset by CMP1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_EXT_RESET</name>
					<description>Selects the reset source for the CMP_ROSC output.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTRESET</name>
							<description>The CMP_ROSC output is reset by the internal chip reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_RESETIN</name>
							<description>The CMP_ROSC output is reset by the CMP_RESET input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[11:10]</bitRange>
				
