cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
				</field>
				<field>
					<name>CMP0_VSEL</name>
					<description>Voltage ladder value for comparator 0. The reference voltage Vref depends on the setting of CMP0_VLADREF (either VDD(3V3) or voltage on pin VREF_CMP). 00000 = Vss. 00001 = 1 x  Vref0 / 31. 00010 = 2 x Vref0 / 31. ... 11111 = Vref0</description>
					<bitRange>[28:24]</bitRange>
				
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:29]</bitRange>
				
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL1</name>
			<description>Comparator 1 control register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMP1_EN</name>
					<description>Comparator 1 enable control.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Comparator 1 disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>Comparator 1 is disabled in Deep Sleep and Power-down modes and re-enabled automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>Comparator 1 is disabled in Power-down mode and re-enabled automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Comparator 1 is enabled.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_OE</name>
					<description>Comparator 1 output enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Comparator 1 output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Comparator 1 output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_STAT</name>
					<description>Comparator 1 status. This bit reflects the comparator 1 output, and is not affected by CMP1_OE.</description>
					<bitRange>[3:3]</bitRange>
				
				</field>
				<field>
					<name>CMP1_VM</name>
					<description>Comparator 1 VM input select.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_1_</name>
							<description>Vref divider 1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN0</name>
							<description>CMP1_IN[0].</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN1</name>
							<description>CMP1_IN[1].</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN2</name>
							<description>CMP1_IN[2].</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN3</name>
							<description>CMP1_IN[3].</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN0</name>
							<description>CMP0_IN[0].</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0_9_V_BAND_</name>
							<description>internal 0.9 V band gap reference.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMPERATURE_SENSOR_</name>
							<description>temperature sensor.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
				
				</field>
				<field>
					<name>CMP1_VP</name>
					<description>Comparator 1 VP input select.</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_0_</name>
							<description>Vref divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN0</name>
							<description>CMP1_IN[0].</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN1</name>
							<description>CMP1_IN[1].</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN2</name>
							<description>CMP1_IN[2].</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN3</name>
							<description>CMP1_IN[3].</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN0</name>
							<description>CMP0_IN[0].</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0_9_V_BAND_</name>
							<description>internal 0.9 V band gap reference.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMPERATURE_SENSOR_</name>
							<description>temperature sensor.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[11:11]</bitRange>
				
				</field>
				<field>
					<name>CMP1_SYNC</name>
					<description>Comparator 1 output synchronization control.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DIRECT</name>
							<description>The comparator 1 output is used directly.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYNCH</name>
							<description>The comparator 1 output is synchronized with the internal bus clock for output to other peripherals.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_HYS</name>
					<description>Comparator 1 hysteresis control. When enabled, hysteresis determines the difference required between the comparator inputs before the comparator output switches. The difference must be in the direction opposite of the current comparator output.</description>
					<bitRange>[14:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>HYSTERESISOFF</name>
							<description>Hysteresis is turned off, comparator output will change as the input voltages cross.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_5_MV_</name>
							<description>Hysteresis = 5 mV.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_10_MV_</name>
							<description>Hysteresis = 10 mV.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_15_MV_</name>
							<description>Hysteresis = 15 mV.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_INTPOL</name>
					<description>Selects the polarity of the CMP1 output for purposes of generating level interrupts. See Table 412.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOTINVERTED</name>
							<description>The CMP1 output is used as-is for generating interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INVERTED</name>
							<description>The CMP1 output is used inverted for generating interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_INTTYPE</name>
					<description>Select comparator 1 interrupt type. See Table 412.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EDGE</name>
							<description>Comparator 1 interrupt is edge triggered.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL</name>
							<description>Comparator 1 interrupt is level triggered.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_INTEDGE</name>
					<description>Select edge triggered interrupt to be active on either high or low transitions, when CMP1_IntType = 0. See Table 412.</description>
					<bitRange>[18:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING</name>
							<description>Comparator 1 interrupt is active on falling edges.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING</name>
							<description>Comparator 1 interrupt is active on rising edges.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DUALEDGE</name>
							<description>Comparator 1 Interrupt is active on both edges.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_INTFLAG</name>
					<description>Comparator 1 interrupt flag.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOTPENDING</name>
							<description>The Comparator 1 interrupt is not pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>The Comparator 1 interrupt is pending. Writing a 1 to this bit clears the flag.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_VLADEN</name>
					<description>Voltage ladder enable for comparator 1.</description>
					<bitRange>[21:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>The Comparator 1 voltage ladder is disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>The Comparator 1 voltage ladder is disabled in Deep Sleep and Power-down modes and re-enabled automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>The Comparator 1 voltage ladder is disabled in Power-down mode and re-enabled automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>The Comparator 1 voltage ladder is enabled.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP1_VLADREF</name>
					<description>Voltage reference select for comparator 1 voltage ladder.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_CMP_PIN_</name>
							<description>VREF_CMP pin.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDA_PIN_</name>
							<description>VDDA pin.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:23]</bitRange>
				
