cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
						</field>
						<field>
							<name>INVBDC</name>
							<description>Controls the polarity of the MCOB outputs for all 3 channels. This bit is typically set to 1 only in 3-phase DC mode.</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OPPOSITE</name>
									<description>The MCOB outputs have opposite polarity from the MCOA outputs (aside from dead time).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SAME</name>
									<description>The MCOB outputs have the same basic polarity as the MCOA outputs. (see Section 24.8.6)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACMODE</name>
							<description>3-phase AC mode select (see Section 24.8.7).</description>
							<bitRange>[30:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>3_PHASE_AC_MODE_OFF</name>
									<description>3-phase AC-mode off: Each PWM channel uses its own timer-counter and period register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_PHASE_AC_MODE_ON_</name>
									<description>3-phase AC-mode on: All PWM channels use the timer-counter and period register of channel 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCMODE</name>
							<description>3-phase DC mode select (see Section 24.8.6).</description>
							<bitRange>[31:31]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>3_PHASE_DC_MODE_OFF</name>
									<description>3-phase DC mode off: PWM channels are independent (unless bit ACMODE = 1)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_PHASE_DC_MODE_ON_</name>
									<description>3-phase DC mode on: The internal MCOA0 output is routed through the CP register (i.e. a mask) register to all six PWM outputs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CON_SET</name>
					<description>PWM Control set address</description>
					<addressOffset>0x004</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RUN0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CENTER0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>POLA0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DTE0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DISUP0_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RUN1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CENTER1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>POLA1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DTE1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DISUP1_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RUN2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CENTER2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>POLA2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DTE2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DISUP2_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[28:21]</bitRange>
						</field>
						<field>
							<name>INVBDC_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ACMODE_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DCMODE_SET</name>
							<description>Writing a one sets the corresponding bit in the CON register.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CON_CLR</name>
					<description>PWM Control clear address</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RUN0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CENTER0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>POLA0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DTE0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DISUP0_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RUN1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CENTER1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>POLA1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DTE1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DISUP1_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RUN2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CENTER2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>POLA2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DTE2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DISUP2_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[28:21]</bitRange>
						</field>
						<field>
							<name>INVBDC_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ACMOD_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DCMODE_CLR</name>
							<description>Writing a one clears the corresponding bit in the CON register.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCON</name>
					<description>Capture Control read address</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0MCI0_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0MCI0_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI1.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI1.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_RE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a rising edge on MCI2.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_FE</name>
							<description>A 1 in this bit enables a channel 0 capture event on a falling edge on MCI2.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI0.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI0.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI1.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI1.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_RE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a rising edge on MCI2.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_FE</name>
							<description>A 1 in this bit enables a channel 1 capture event on a falling edge on MCI2.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI0.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI0.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI1.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI1.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_RE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a rising edge on MCI2.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_FE</name>
							<description>A 1 in this bit enables a channel 2 capture event on a falling edge on MCI2.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RT0</name>
							<description>If this bit is 1, TC0 is reset by a channel 0 capture event.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RT1</name>
							<description>If this bit is 1, TC1 is reset by a channel 1 capture event.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RT2</name>
							<description>If this bit is 1, TC2 is reset by a channel 2 capture event.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						
						
						
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCON_SET</name>
					<description>Capture Control set address</description>
					<addressOffset>0x010</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CAP0MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP0MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP0MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP1MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP1MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP1MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAP2MCI0_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAP2MCI1_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_RE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CAP2MCI2_FE_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RT0_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RT1_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RT2_SET</name>
							<description>Writing a one sets the corresponding bits in the CAPCON register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						
						
						
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
