cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
				<register>
					<name>CNTCON</name>
					<description>Count Control read address</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TC0MCI0_RE</name>
							<description>Counter 0 rising edge mode, channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI0 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE0 is 1, counter 0 advances on a rising edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC0MCI0_FE</name>
							<description>Counter 0 falling edge mode, channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI0 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE0 is 1, counter 0 advances on a falling edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC0MCI1_RE</name>
							<description>Counter 0 rising edge mode, channel 1.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI1 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE0 is 1, counter 0 advances on a rising edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC0MCI1_FE</name>
							<description>Counter 0 falling edge mode, channel 1.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI1 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE0 is 1, counter 0 advances on a falling edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC0MCI2_RE</name>
							<description>Counter 0 rising edge mode, channel 2.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI0 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE0 is 1, counter 0 advances on a rising edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC0MCI2_FE</name>
							<description>Counter 0 falling edge mode, channel 2.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI0 does not affect counter 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLLING</name>
									<description>If MODE0 is 1, counter 0 advances on a falling edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI0_RE</name>
							<description>Counter 1 rising edge mode, channel 0.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI0 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE1 is 1, counter 1 advances on a rising edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI0_FE</name>
							<description>Counter 1 falling edge mode, channel 0.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI0 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE1 is 1, counter 1 advances on a falling edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI1_RE</name>
							<description>Counter 1 rising edge mode, channel 1.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI1 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE1 is 1, counter 1 advances on a rising edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI1_FE</name>
							<description>Counter 1 falling edge mode, channel 1.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI0 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE1 is 1, counter 1 advances on a falling edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI2_RE</name>
							<description>Counter 1 rising edge mode, channel 2.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI2 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE1 is 1, counter 1 advances on a rising edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC1MCI2_FE</name>
							<description>Counter 1 falling edge mode, channel 2.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI2 does not affect counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE1 is 1, counter 1 advances on a falling edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI0_RE</name>
							<description>Counter 2 rising edge mode, channel 0.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI0 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE2 is 1, counter 2 advances on a rising edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI0_FE</name>
							<description>Counter 2 falling edge mode, channel 0.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI0 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE2 is 1, counter 2 advances on a falling edge on MCI0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI1_RE</name>
							<description>Counter 2 rising edge mode, channel 1.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI1 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>If MODE2 is 1, counter 2 advances on a rising edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI1_FE</name>
							<description>Counter 2 falling edge mode, channel 1.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI1 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE2 is 1, counter 2 advances on a falling edge on MCI1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI2_RE</name>
							<description>Counter 2 rising edge mode, channel 2.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_RISING_EDGE_ON_MCI</name>
									<description>A rising edge on MCI2 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISIING</name>
									<description>If MODE2 is 1, counter 2 advances on a rising edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC2MCI2_FE</name>
							<description>Counter 2 falling edge mode, channel 2.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_FALLING_EDGE_ON_MC</name>
									<description>A falling edge on MCI2 does not affect counter 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>If MODE2 is 1, counter 2 advances on a falling edge on MCI2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[28:18]</bitRange>
							
