cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
	</registers>
</peripheral>

		
		

		<peripheral>
	<name>SDMMC</name>
	<description>SD card</description>
	<groupName>SDMMC</groupName>
	<baseAddress>0x400C0000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SDMMC</name>
	<value>29</value>
	</interrupt>
	<registers>
		<register>
			<name>PWR</name>
			<description>Power control register.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTRL</name>
					<description>Power control</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWER_OFF</name>
							<description>Power-off</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWER_UP</name>
							<description>Power-up</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWER_ON</name>
							<description>Power-on</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:2]</bitRange>
		
				</field>
				<field>
					<name>OPENDRAIN</name>
					<description>SD_CMD output control.</description>
					<bitRange>[6:6]</bitRange>
		
				</field>
				<field>
					<name>ROD</name>
					<description>Rod control.</description>
					<bitRange>[7:7]</bitRange>
		
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
		
				</field>
			</fields>
		</register>
		<register>
			<name>CLOCK</name>
			<description>Clock control register.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIV</name>
					<description>Bus clock period: SD_CLK frequency = MCLK / [2x(ClkDiv+1)].</description>
					<bitRange>[7:0]</bitRange>
		
				</field>
				<field>
					<name>ENABLE</name>
					<description>Enable SD card bus clock:</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLOCK_DISABLED_</name>
							<description>Clock disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLOCK_ENABLED_</name>
							<description>Clock enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWRSAVE</name>
					<description>Disable SD_CLK output when bus is idle:</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ALWAYS_ENABLED_</name>
							<description>Always enabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLOCK_ENABLED_WHEN_B</name>
							<description>Clock enabled when bus is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BYPASS</name>
					<description>Enable bypass of clock divide logic:</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_BYPASS_</name>
							<description>Disable bypass.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_BYPASS_MCLK_</name>
							<description>Enable bypass. MCLK driven to card bus output (SD_CLK).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WIDEBUS</name>
					<description>Enable wide bus mode.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_BUS_MODE_O</name>
							<description>Standard bus mode (only SD_DAT[0] used).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WIDE_BUS_MODE_SD_DA</name>
							<description>Wide bus mode (SD_DAT[3:0] used)</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:12]</bitRange>
		
				</field>
			</fields>
		</register>
		<register>
			<name>ARGUMENT</name>
			<description>Argument register.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CmdArg</name>
					<description>Command argument</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>COMMAND</name>
			<description>Command register.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CmdIndex</name>
					<description>Command index.</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>Response</name>
					<description>If set, CPSM waits for a response.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>LongRsp</name>
					<description>If set, CPSM receives a 136 bit long response.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>Interrupt</name>
					<description>If set, CPSM disables command timer and waits for interrupt request.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>Pending</name>
					<description>If set, CPSM waits for CmdPend before it starts sending a command.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>Enable</name>
					<description>If set, CPSM is enabled.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RESPCMD</name>
			<description>Response command register.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESPCMD</name>
					<description>Response command index</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>RESPONSE%s</name>
			<description>Response register.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATUS</name>
					<description>Card status</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DATATIMER</name>
			<description>Data Timer.</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATATIME</name>
					<description>Data timeout period.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DATALENGTH</name>
			<description>Data length register.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATALENGTH</name>
					<description>Data length value</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DATACTRL</name>
			<description>Data control register.</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE</name>
					<description>Data transfer enable.</description>
					<bitRange>[0:0]</bitRange>
		
