cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
	<register>																						
		<name>PCONP0</name>																					
		<description>Power Control for Peripherals</description>																					
		<addressOffset>0x0C4</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0x0408829E</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PCLCD</name>																			
				<description>LCD controller power/clock control bit.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCTIM0</name>																			
				<description>Timer/Counter 0 power/clock control bit.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCTIM1</name>																			
				<description>Timer/Counter 1 power/clock control bit.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUART0</name>																			
				<description>UART0 power/clock control bit.</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUART1</name>																			
				<description>UART1 power/clock control bit.</description>																			
				<bitRange>[4:4]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCPWM0</name>																			
				<description>PWM0 power/clock control bit.</description>																			
				<bitRange>[5:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCPWM1</name>																			
				<description>PWM1 power/clock control bit.</description>																			
				<bitRange>[6:6]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCI2C0</name>																			
				<description>I2C0 interface power/clock control bit.</description>																			
				<bitRange>[7:7]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUART4</name>																			
				<description>UART4 power/clock control bit.</description>																			
				<bitRange>[8:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCRTC</name>																			
				<description>RTC and Event Monitor/Recorder power/clock control bit.</description>																			
				<bitRange>[9:9]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCSSP1</name>																			
				<description>SSP 1 interface power/clock control bit.</description>																			
				<bitRange>[10:10]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCEMC</name>																			
				<description>External Memory Controller power/clock control bit.</description>																			
				<bitRange>[11:11]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCADC</name>																			
				<description>A/D converter (ADC) power/clock control bit. Note: Clear the PDN bit in the AD0CR before clearing this bit, and set this bit before attempting to set PDN.</description>																			
				<bitRange>[12:12]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCCAN1</name>																			
				<description>CAN Controller 1 power/clock control bit.</description>																			
				<bitRange>[13:13]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCCAN2</name>																			
				<description>CAN Controller 2 power/clock control bit.</description>																			
				<bitRange>[14:14]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCGPIO</name>																			
				<description>Power/clock control bit for IOCON, GPIO, and GPIO interrupts.</description>																			
				<bitRange>[15:15]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCSPIFI</name>																			
				<description>SPI Flash Interface power/clock control bit.</description>																			
				<bitRange>[16:16]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCMCPWM</name>																			
				<description>Motor Control PWM power/clock control bit.</description>																			
				<bitRange>[17:17]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCQEI</name>																			
				<description>Quadrature Encoder Interface power/clock control bit.</description>																			
				<bitRange>[18:18]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCI2C1</name>																			
				<description>I2C1 interface power/clock control bit.</description>																			
				<bitRange>[19:19]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCSSP2</name>																			
				<description>SSP2 interface power/clock control bit.</description>																			
				<bitRange>[20:20]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCSSP0</name>																			
				<description>SSP0 interface power/clock control bit.</description>																			
				<bitRange>[21:21]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCTIM2</name>																			
				<description>Timer 2 power/clock control bit.</description>																			
				<bitRange>[22:22]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCTIM3</name>																			
				<description>Timer 3 power/clock control bit.</description>																			
				<bitRange>[23:23]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUART2</name>																			
				<description>UART 2 power/clock control bit.</description>																			
				<bitRange>[24:24]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUART3</name>																			
				<description>UART 3 power/clock control bit.</description>																			
				<bitRange>[25:25]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCI2C2</name>																			
				<description>I2C interface 2 power/clock control bit.</description>																			
				<bitRange>[26:26]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCI2S</name>																			
				<description>I2S interface power/clock control bit.</description>																			
				<bitRange>[27:27]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCSDC</name>																			
				<description>SD Card interface power/clock control bit.</description>																			
				<bitRange>[28:28]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCGPDMA</name>																			
				<description>GPDMA function power/clock control bit.</description>																			
				<bitRange>[29:29]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCENET</name>																			
				<description>Ethernet block power/clock control bit.</description>																			
				<bitRange>[30:30]</bitRange>																			
			</field>																				
			<field>																				
				<name>PCUSB</name>																			
				<description>USB interface power/clock control bit.</description>																			
				<bitRange>[31:31]</bitRange>																			
			</field>																				
		</fields>																					
	</register>	
			<register>																						
				<name>PCONP1</name>																					
				<description>Power Control for Peripherals</description>																					
				<addressOffset>0x0C8</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00000000</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved.</description>																			
						<bitRange>[2:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>PCCMP</name>																			
						<description>comparator 0/1 power/clock control bit.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>	
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved.</description>																			
						<bitRange>[31:4]</bitRange>																			
					</field>	
					</fields>																			
			</register>
	<register>																						
		<name>EMCCLKSEL</name>																					
		<description>External Memory Controller Clock Selection register</description>																					
		<addressOffset>0x100</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>EMCDIV</name>																			
				<description>Selects the EMC clock rate relative to the CPU clock.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>THE_EMC_USES_THE_SAM</name>																	
						<description>The EMC uses the same clock as the CPU.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>THE_EMC_USES_A_CLOCK</name>																	
						<description>The EMC uses a clock at half the rate of the CPU.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:1]</bitRange>																			
																		
