cmsis-svd/cmsis-svd/data/NXP/LPC408x_7x.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLKSRCSEL</name>																					
		<description>Clock Source Select Register</description>																					
		<addressOffset>0x10C</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLKSRC</name>																			
				<description>Selects the clock source for sysclk and PLL0 as follows:</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SELECTS_THE_INTERNAL</name>																	
						<description>Selects the Internal RC oscillator as the sysclk and PLL0 clock source (default).</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SELECTS_THE_MAIN_OSC</name>																	
						<description>Selects the main oscillator as the sysclk and PLL0 clock source.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:1]</bitRange>																			
																		
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CANSLEEPCLR</name>																					
		<description>Allows clearing the current CAN channel sleep state as well as reading that state.</description>																					
		<addressOffset>0x110</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>CAN1SLEEP</name>																			
				<description>Sleep status and control for CAN channel 1. Read: when 1, indicates that CAN channel 1 is in the sleep mode. Write: writing a 1 causes clocks to be restored to CAN channel 1.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>CAN2SLEEP</name>																			
				<description>Sleep status and control for CAN channel 2. Read: when 1, indicates that CAN channel 2 is in the sleep mode. Write: writing a 1 causes clocks to be restored to CAN channel 2.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:3]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CANWAKEFLAGS</name>																					
		<description>Allows reading the wake-up state of the CAN channels.</description>																					
		<addressOffset>0x114</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>CAN1WAKE</name>																			
				<description>Wake-up status for CAN channel 1. Read: when 1, indicates that a falling edge has occurred on the receive data line of CAN channel 1. Write: writing a 1 clears this bit.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>CAN2WAKE</name>																			
				<description>Wake-up status for CAN channel 2. Read: when 1, indicates that a falling edge has occurred on the receive data line of CAN channel 2. Write: writing a 1 clears this bit.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:3]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>EXTINT</name>																					
		<description>External Interrupt Flag Register</description>																					
		<addressOffset>0x140</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>EINT0</name>																			
				<description>In level-sensitive mode, this bit is set if the EINT0 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT0 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.[1]</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>EINT1</name>																			
				<description>In level-sensitive mode, this bit is set if the EINT1 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT1 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.[1]</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>EINT2</name>																			
				<description>In level-sensitive mode, this bit is set if the EINT2 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT2 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.[1]</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>EINT3</name>																			
				<description>In level-sensitive mode, this bit is set if the EINT3 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT3 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.[1]</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:4]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>EXTMODE</name>																					
		<description>External Interrupt Mode register</description>																					
		<addressOffset>0x148</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>EXTMODE0</name>																			
				<description>Level or edge sensitivity select for EINT0.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>LEVEL_SENSITIVE_</name>																	
						<description>Level sensitive.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EDGE_SENSITIVE_</name>																	
						<description>Edge sensitive.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>EXTMODE1</name>																			
				<description>Level or edge sensitivity select for EINT1.</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>LEVEL_SENSITIVE_</name>																	
						<description>Level sensitive.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EDGE_SENSITIVE_</name>																	
						<description>Edge sensitive.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>EXTMODE2</name>																			
				<description>Level or edge sensitivity select for EINT2.</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>LEVEL_SENSITIVE_</name>																	
						<description>Level sensitive.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EDGE_SENSITIVE_</name>																	
						<description>Edge sensitive.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>EXTMODE3</name>																			
				<description>Level or edge sensitivity select for EINT3.</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>LEVEL_SENSITIVE_</name>																	
						<description>Level sensitive.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EDGE_SENSITIVE_</name>																	
						<description>Edge sensitive.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:4]</bitRange>																			
																		
